IDEA StatiCa Open Model
Material.StateOfThermalConductivity Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 State of thermal conductivity curvature
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ThermalConductivityState StateOfThermalConductivity { get; set; }
Public Property StateOfThermalConductivity As ThermalConductivityState
	Get
	Set
public:
property ThermalConductivityState StateOfThermalConductivity {
	ThermalConductivityState get ();
	void set (ThermalConductivityState value);
}
Property Value
Type: ThermalConductivityState
See Also
Reference
Material Class
IdeaRS.OpenModel.Material Namespace